In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({'a':[1,2,np.nan],
                'b':[5,np.nan,np.nan],
                'c':[1,2,3]})

In [4]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [9]:
df.dropna(thresh=3)

     a    b  c
0  1.0  5.0  1

In [10]:
df.fillna(value='***')

     a    b  c
0  1.0  5.0  1
1  2.0  ***  2
2  ***  ***  3

In [11]:
df['b'].fillna(value=df['c'].mean())

0    5.0
1    2.0
2    2.0
Name: b, dtype: float64

In [12]:
df['c'].mean()

2.0

In [13]:
data={'cmpny':['googl','googl','mcrosft','mcrosft','fb','fb'],
     'prsn':['vidya','ivana','rajisha','vishnu','sam','sarah'],
     'sales':[200,1230,520,870,330,4120]}

In [14]:
df=pd.DataFrame(data)

In [15]:
df

     cmpny     prsn  sales
0    googl    vidya    200
1    googl    ivana   1230
2  mcrosft  rajisha    520
3  mcrosft   vishnu    870
4       fb      sam    330
5       fb    sarah   4120

In [17]:
a=df.groupby('cmpny')

In [18]:
a.mean()

         sales
cmpny
fb        2225
googl      715
mcrosft    695

In [19]:
df.groupby('cmpny').min()

            prsn  sales
cmpny
fb           sam    330
googl      ivana    200
mcrosft  rajisha    520

In [20]:
df.groupby('cmpny').max()

           prsn  sales
cmpny
fb        sarah   4120
googl     vidya   1230
mcrosft  vishnu    870

In [21]:
df.groupby('cmpny').std()

               sales
cmpny
fb       2679.934701
googl     728.319985
mcrosft   247.487373

In [22]:
df.groupby('cmpny').count()

         prsn  sales
cmpny
fb          2      2
googl       2      2
mcrosft     2      2

In [24]:
df.describe()

             sales
count     6.000000
mean   1211.666667
std    1473.409877
min     200.000000
25%     377.500000
50%     695.000000
75%    1140.000000
max    4120.000000

In [26]:
df.groupby('cmpny').describe()

        sales
        count    mean          std    min     25%     50%     75%     max
cmpny
fb        2.0  2225.0  2679.934701  330.0  1277.5  2225.0  3172.5  4120.0
googl     2.0   715.0   728.319985  200.0   457.5   715.0   972.5  1230.0
mcrosft   2.0   695.0   247.487373  520.0   607.5   695.0   782.5   870.0